model {
  ssd {
    num_classes: 5
    image_resizer {
      fixed_shape_resizer {
        height: 600
        width: 600
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v2"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 3.99999989895e-05
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.0299999993294
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.999700009823
          center: true
          scale: true
          epsilon: 0.0010000000475
          train: true
        }
      }

      use_depthwise: true
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 3.99999989895e-05
            }
          }
          initializer {
            truncated_normal_initializer {
              mean: 0.0
              stddev: 0.0299999993294
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.999700009823
            center: true
            scale: true
            epsilon: 0.0010000000475
            train: true
          }
        }
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.500000011921
        kernel_size: 3
        box_code_size: 4
        apply_sigmoid_to_scores: false
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.20000000298
        max_scale: 0.949999988079
        aspect_ratios: 0.5
        aspect_ratios: 1.0
        aspect_ratios: 2.0
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 0.300000011921
        iou_threshold: 0.600000023842
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          alpha: 0.25
          gamma: 2.0
        }
      }

      classification_weight: 1.0
      localization_weight: 1.0
    }
  }
}
train_config {
  batch_size: 32
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_vertical_flip {
    }
  }
  data_augmentation_options {
    random_jitter_boxes  {
        ratio: 0.2
    }
  }
  optimizer {
    adam_optimizer: {
        learning_rate {
            cosine_decay_learning_rate {
              learning_rate_base: 0.00039999998989515007
              total_steps: 25000
              warmup_learning_rate: 0.00013000000035390258
              warmup_steps: 2000
            }
        }
    }
  }
  fine_tune_checkpoint: "ckpt/model.ckpt"
  num_steps: 15000
  fine_tune_checkpoint_type: "detection"
}
train_input_reader {
  label_map_path: "/data/Datasets/EIPH_WSI/RCNN-Patches/1024_API/label_map.pbtxt"
  num_readers: 5
  tf_record_input_reader {
    input_path: "/data/Datasets/EIPH_WSI/RCNN-Patches/1024_API/train/*.tfrecord"
  }
}
eval_config {
  #metrics_set: "pascal_voc_detection_metrics"
  visualize_groundtruth_boxes: true
  num_examples: 1000
  max_evals: 100
  min_score_threshold: 0.1
  use_moving_averages: false
  max_num_boxes_to_visualize: 500
}
eval_input_reader {
  label_map_path: "/data/Datasets/EIPH_WSI/RCNN-Patches/1024_API/label_map.pbtxt"
  shuffle: true
  num_readers: 1
  tf_record_input_reader {
    input_path: "/data/Datasets/EIPH_WSI/RCNN-Patches/1024_API/val/*.tfrecord"
  }
}

